// namespace Hospital.BusinessLogic.Models;
//
// public static class DiagnosisDictionary
// {
//    public static Dictionary<string, List<string>> Diagnoses = new()
//    {
//       //терапия
//       {"Грипп", new List<string> { "кашель", "температура", "насморк", "боль в горле"}},
//       {"Пневмония", new List<string> { "кашель", "температура", "отдышка", "боль в груди"}},
//       {"Анемия", new List<string> { "слабость", "головокружение", "бледность"}},
//       {"Гастрит", new List<string> { "боль в животе", "тошнота", "изжога"}},
//       
//       //педиатрия
//       {"Ветрянка", new List<string>{"сыпь", "температура", "зуд"}},
//       {"Корь", new List<string>{"сыпь", "температура", "кашель", "конъюнктивит"}},
//       {"Ангина", new List<string>{"боль в горле", "температура", "увеличение лимфоузлов"}},
//       {"Отит", new List<string>{"боль в горле", "температура", "раздражительность"}},
//       
//       //кардиология
//       {"Стенокардия", new List<string> { "боль в груди", "одышка", "потливость"}},
//       {"Инфаркт миокарда", new List<string> { "сильная боль в груди", "тошнота", "головокружение", "потливость"}},
//       {"Гипертония", new List<string> { "головная боль", "повышенное давление", "шум в ушах"}},
//       {"Аритмия", new List<string> { "учащённое сердцебиение", "слабость", "головокружение"}},
//    };
//
// }